_posts/2013-05-05-Getting-keyword-options-in-org-files.html
---
title: Getting keyword options in org-files
date: 2013/05/05 14:03:09
updated: 2013/06/10 10:25:03
categories: 
tags: 
---


<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>file-options</title>
<!-- 2013-06-10 Mon 10:24 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

</head>
<body>
<div id="content">
<h1 class="title">file-options</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Getting keyword options in org-files</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Getting keyword options in org-files</h2>
<div class="outline-text-2" id="text-1">

<p>
Continuing my work in using org-mode as a structured markup language to encode data in files, today we look at how to extract keywords and properties from org-files. This will enable me to store data in the org-files, and then retrieve it later from code. For example, you may want to store the email address, or a student-id in the file so you can connect some other property such as a grade to it.
</p>

<p>
First we consider the built-in org commands to access aspects of the file properties. The <code>org-export-get-environment</code> command returns a plist of properties of the file. 
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(org-export-get-environment)
</pre>
</div>

<pre class="example">
(:author ("John Kitchin") :creator "Generated by Org mode 7.9.4 in Emacs 24.0.92.1." :date nil :description nil :email "johnrkitchin@gmail.com" :exclude-tags ("noexport") :headline-levels 3 :keywords nil :language "en" :preserve-breaks nil :section-numbers t :select-tags ("export") :time-stamp-file t :title "file-options" :with-archived-trees headline :with-author t :with-clocks nil :with-creator comment :with-drawers nil :with-email nil :with-emphasize t :with-entities t :with-fixed-width t :with-footnotes t :with-inlinetasks t :with-plannings nil :with-priority nil :with-special-strings t :with-sub-superscript t :with-toc t :with-tables t :with-tags not-in-toc :with-tasks t :with-timestamps t :with-todo-keywords t :input-file "c:/Users/jkitchin/Dropbox/blogofile-jkitchin.github.com/_blog/file-options.org" :footnote-definition-alist nil :id-alist nil :macro-modification-time "(eval (format-time-string \"$1\" '(20870 38242)))" :macro-input-file "file-options.org" :macro-date "(eval (format-time-string \"$1\"))" :macro-time "(eval (format-time-string \"$1\"))" :macro-property "(eval (org-entry-get nil \"$1\" 'selective))" :back-end nil :translate-alist nil)
</pre>

<p>
We can access a particular property like this:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(plist-get (org-export-get-environment) '<span style="color: #cd0000; font-weight: bold;">:email</span>)
</pre>
</div>

<pre class="example">
"johnrkitchin@gmail.com"
</pre>

<p>
Most of those properties are set externally to this file. It may be useful to set your own options in a file, e.g.
we may want to set a STUDENT-ID tag in our file.
</p>

<pre class="example">
#+STUDENT-ID: jkitchin
</pre>

<p>
We want to be able to extract the value of that keyword in emacs-lisp code. Here is one org way to do that. This code parses the buffer to get a list of elements, then applies a lambda function that makes a (key . value) to all the keyword elements, finally returning an alist. The second function gets the value for a specific key.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #ff0000; font-weight: bold; font-style: italic;">; </span><span style="color: #ff0000; font-weight: bold; font-style: italic;">suggested by Nicolas Goaziou</span>
(<span style=
Wrote /home/jkitchin/.emacs.d/ac-comphist.dat
"color: #8b0000; font-weight: bold;">defun</span> <span style="color: #8b2323; font-weight: bold;">jk-org-kwds</span> ()
  <span style="color: #228b22; font-style: italic;">"parse the buffer and return a cons list of (property . value)</span>
<span style="color: #228b22; font-style: italic;">from lines like:</span>
<span style="color: #228b22; font-style: italic;">#+PROPERTY: value"</span>
  (org-element-map (org-element-parse-buffer 'element) 'keyword
                   (<span style="color: #8b0000; font-weight: bold;">lambda</span> (keyword) (cons (org-element-property <span style="color: #cd0000; font-weight: bold;">:key</span> keyword)
                                           (org-element-property <span style="color: #cd0000; font-weight: bold;">:value</span> keyword)))))

(<span style="color: #8b0000; font-weight: bold;">defun</span> <span style="color: #8b2323; font-weight: bold;">jk-org-kwd</span> (KEYWORD)
  <span style="color: #228b22; font-style: italic;">"get the value of a KEYWORD in the form of #+KEYWORD: value"</span>
  (cdr (assoc KEYWORD (jk-org-kwds))))

(jk-org-kwd <span style="color: #228b22; font-style: italic;">"STUDENT-ID"</span>)
</pre>
</div>

<pre class="example">
jkitchin
</pre>

<p>
That is serious org-fu there. Here is an alternative approach that uses searching and regular expressions. The idea is to use a case-insensitive regular expression search in the buffer to grab the value. 
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000; font-weight: bold;">defun</span> <span style="color: #8b2323; font-weight: bold;">jk-get-file-keyword</span> (KEYWORD)
  <span style="color: #228b22; font-style: italic;">"get the value from a line like this</span>
<span style="color: #228b22; font-style: italic;">#+KEYWORD: value</span>
<span style="color: #228b22; font-style: italic;">in a file."</span>
  (interactive)
  (<span style="color: #8b0000; font-weight: bold;">let</span> ((case-fold-search t)
        (re (format <span style="color: #228b22; font-style: italic;">"^#\\+%s:[ \t]+</span><span style="color: #228b22; font-weight: bold; font-style: italic;">\\</span><span style="color: #228b22; font-weight: bold; font-style: italic;">(</span><span style="color: #228b22; font-style: italic;">[</span><span style="color: #228b22; font-style: italic;">^</span><span style="color: #228b22; font-style: italic;">\t\n]+</span><span style="color: #228b22; font-weight: bold; font-style: italic;">\\</span><span style="color: #228b22; font-weight: bold; font-style: italic;">)</span><span style="color: #228b22; font-style: italic;">"</span> KEYWORD)))
    (<span style="color: #8b0000; font-weight: bold;">if</span> (not (<span style="color: #8b0000; font-weight: bold;">save-excursion</span>
               (or (re-search-forward re nil t)
                   (re-search-backward re nil t))))
        (<span style="color: #ff0000; font-weight: bold;">error</span> (format <span style="color: #228b22; font-style: italic;">"No line containing #+%s: value found"</span> KEYWORD)))
    (match-string 1)))

(jk-get-file-keyword <span style="color: #228b22; font-style: italic;">"STUDENT-ID"</span>)
</pre>
</div>

<pre class="example">
jkitchin
</pre>

<p>
Both methods basically do the same thing, and enable you to store data in org-files that is easily retrievable.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Kitchin</p>
<p class="date">Created: 2013-06-10 Mon 10:24</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.1.1 (<a href="http://orgmode.org">Org</a> mode 8.0.3)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html><p>Copyright (C) 2013 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2013/05/05/Getting-keyword-options-in-org-files.org">org-mode source</a><p>